# include "app_wdog.h"


IWDG_HandleTypeDef IWDG_Handler;


/*
*********************************************************************************************************
*                                         app_wdog_Config 
*
* Description: 初始化看门狗
*             
* Arguments : feedTime:看门狗复位时间，也就是再次喂狗时间间隔，单位为ms
*
* Note(s)   : 注意，看门狗一旦打开，就不能再关闭
*********************************************************************************************************
*/
void app_wdog_Config(uint16_t feedTime)
{
	uint16_t reload = 0;
	
	IWDG->KR = ((uint16_t)0x5555);
	IWDG->PR = 4;
	reload = (40 * feedTime) / 64;		/*  计数重装载值  */
	IWDG->RLR = reload;
	
	IWDG->KR = ((uint16_t)0xAAAA);
	IWDG->KR = ((uint16_t)0xCCCC);
}



/*
*********************************************************************************************************
*                                          app_wdog_Feed
*
* Description: 看门狗喂食函数
*             
* Arguments : 无
*
* Note(s)   : 如果打开看门狗，该函数一定要再喂食时间内调用，否则会引发系统复位
*********************************************************************************************************
*/
void app_wdog_Feed(void)
{
	IWDG->KR = ((uint16_t)0xAAAA);
}

